In [16]:
import numpy as np
import pandas as pd
from numpy.random import randn
#np.random.seed(101)

In [17]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [21]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [22]:
df

             A         B
G1 1 -0.134841  0.390528
   2  0.166905  0.184502
   3  0.807706  0.072960
G2 1  0.638787  0.329646
   2 -0.497104 -0.754070
   3 -0.943406  0.484752

In [27]:
df.loc['G1']

          A         B
1 -0.134841  0.390528
2  0.166905  0.184502
3  0.807706  0.072960

In [28]:
df.loc['G1'].loc[1]

A   -0.134841
B    0.390528
Name: 1, dtype: float64

In [30]:
df.index.names = 'Groups Num'.split()

In [31]:
df

                   A         B
Groups Num
G1     1   -0.134841  0.390528
       2    0.166905  0.184502
       3    0.807706  0.072960
G2     1    0.638787  0.329646
       2   -0.497104 -0.754070
       3   -0.943406  0.484752

In [37]:
# want element: G2 > 2 > B = -0.754070
df.loc['G2'].loc[2]['B']

-0.7540697010400628

In [39]:
# want element: G1 > 3 > A = 0.807706
df.loc['G1'].loc[3]['A']

0.8077059142577141

# CROSS SECTION

In [43]:
df

                   A         B
Groups Num
G1     1   -0.134841  0.390528
       2    0.166905  0.184502
       3    0.807706  0.072960
G2     1    0.638787  0.329646
       2   -0.497104 -0.754070
       3   -0.943406  0.484752

In [40]:
df.loc['G1']

            A         B
Num
1   -0.134841  0.390528
2    0.166905  0.184502
3    0.807706  0.072960

In [41]:
df.xs('G1')

            A         B
Num
1   -0.134841  0.390528
2    0.166905  0.184502
3    0.807706  0.072960

In [42]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.134841  0.390528
G2      0.638787  0.329646